{
    "Intro": {
        "heading": "Hi, ich bin Theo. Kreative Frontend-Entwicklerin verliebt in UX, Clean Code und Design.",
        "description": "Ich arbeite seit 2016 als Frontend-Entwicklerin und stehe für saubere Frontend-Architekturen, präzises Testing und agiles Arbeiten in interdisziplinären, cross-funktionalen Teams. <br/><br/>Mein Fokus: Prozesse modernisieren, nutzerzentrierte Webanwendungen entwickeln und dabei strukturiert und lösungsorientiert arbeiten.",
        "linkToProjects": "<link>Zur Projektübersicht</link>"
    },
    "Projects": {
        "heading": "Projekte",
        "description": "Eine kleine Auswahl meiner Lieblingsprojekte, an denen ich mitgewirkt habe.",
        "filter": "Filtern nach Technologie:",
        "technologiesUsed": "Verwendete Technologien:",
        "result": "Ergebnis",
        "responsibilities": "Auswahl einiger übernommene Aufgaben:",
        "projects": {
            "project1": {
                "shortTitle": "Modernisierung einer Lagerverwaltung",
                "projectTitle": "Modernisierung und Weiterentwicklung für die Lagerverwaltung eines renommierten Online-Händlers",
                "role": "Beraterin, Frontend-Entwicklerin",
                "customerType": "für einen europaweit operierenden Onlinehändler",
                "responsibilitiesTaken_1": "Projektkommunikation auf Englisch für eine reibungslose internationale Zusammenarbeit",
                "responsibilitiesTaken_2": "Durchführung zahlreicher Pair-Programming- und Review-Sessions zur aktiven Wissensvermittlung und Förderung der Zusammenarbeit im Team",
                "responsibilitiesTaken_3": "Entwicklung spezialisierter Features zur Unterstützung von browserbasierten Anwendungen für Barcode-Scanner, um eine effiziente Datenerfassung zu gewährleisten",
                "responsibilitiesTaken_4": "Enge Zusammenarbeit mit Logistikexperten und Backend-Entwicklern zur Optimierung und Neuentwicklung von Schnittstellen für eine nahtlose Systemintegration und verbesserten Prozessabläufen",
                "result": "Das Projekt digitalisierte erfolgreich den Picking-Prozess für ca. 25.000 Artikelverkäufe pro Tag und steigerte die Genauigkeit erheblich. Kernstück war eine browserbasierte Lösung für Barcode-Scanner, die effiziente und fehlerfreie Datenerfassung ermöglichte. Optimierte Benutzeroberflächen sorgten für barrierefreie Nutzung, auch für Mitarbeitende mit Sehschwäche oder Analphabetismus, was die Produktivität deutlich erhöhte. Zudem wurden externe Mitarbeitende in modernen Frontend-Technologien wie React geschult, sodass sie das Projekt nach Übergabe selbstständig weiterentwickeln konnten."
            },
            "project2": {
                "shortTitle": "Neuentwicklung einer Personalvermittlungsplattform",
                "projectTitle": "Neuentwicklung einer Plattform für die Personalvermittlung in der Pflegebranche",
                "role": "Frontend-Entwicklerin",
                "customerType": "für einen Personalvermittler in der Pflegebranche",
                "responsibilitiesTaken_1": "Entwicklung einer skalierbaren Frontend-Architektur basierend auf modernen Best Practices",
                "responsibilitiesTaken_2": "Schnelle Bereitstellung einer minimal funktionsfähigen Plattform zur frühzeitigen Einbindung der Endnutzer",
                "responsibilitiesTaken_3": "Regelmäßige Abstimmung mit Stakeholdern zur Anpassung der Projektanforderungen",
                "responsibilitiesTaken_4": "Implementierung von Monitoring-Lösungen mit Sentry zur Optimierung der Systemstabilität"
            },
            "project3": {
                "shortTitle": "Hochperformanter Fashion-Onlineshop",
                "projectTitle": "Neuentwicklung eines Onlineshops für Streetwear",
                "role": "Frontend-Entwicklerin",
                "customerType": "für ein deutsches, lokal ansässiges E-Commerce-Unternehmen",
                "responsibilitiesTaken_1": "Einsatz eines Static-Site-Generators  mit SEO-Optimierungen zur Schaffung einer leistungsstarken und schnellen Onlineshop-Plattform",
                "responsibilitiesTaken_2": "Implementierung eines leicht bedienbaren Content-Management-Systems zur flexiblen Verwaltung und Anpassung von Modulen im Onlineshop",
                "responsibilitiesTaken_3": "Sicherstellung einer reibungslosen Integration und Kommunikation zwischen dem Shopify-System und der Web-Frontend-Lösung in Gatsby mittels GraphQL und Netlify",
                "responsibilitiesTaken_4": "Aufbau und Pflege einer stabilen Continuous Integration / Continuous Deployment zur Unterstützung regelmäßiger und verlässlicher Shop-Updates"
            },
            "project4": {
                "shortTitle": "Nutzeroberfläche für Wissenschaftler und KI",
                "projectTitle": "Neuentwicklung einer Nutzeroberflächer für verteiltes Lernen mittels KI",
                "role": "Frontend-Entwicklerin",
                "customerType": "für ein wissenschaftliches Institut (IT-Forensik und Mediensicherheit)",
                "responsibilitiesTaken_1": "Neuimplementierung einer Web-Anwendung in React mit Vite angepasst auf die Bedürfnisse von Wissenschaftlern zum Trainieren von Modellen",
                "responsibilitiesTaken_2": "Aktives Mitwirken in einem agilen, crossfunktionalen Team mit zweiwöchigen Sprint-Zyklen zur Förderung von Transparenz, Flexibilität und Teameffizienz",
                "responsibilitiesTaken_3": "Konzeption, Entwicklung und Testing von Komponenten in TypeScript, Vitest und Vite",
                "responsibilitiesTaken_4": "Regelmäßige Planung und Durchführung von Sprint-Reviews zur Präsentation des Projektfortschritts und zur Abstimmung mit allen relevanten Stakeholdern"
            },
            "project5": {
                "shortTitle": "Neugestaltung und -entwicklung einer Webseite",
                "projectTitle": "Neuentwicklung und -gestaltung einer Internetpräsenz",
                "role": "Frontend-Entwicklerin, UX/UI-Designerin",
                "customerType": "für einen IT-Dienstleister",
                "responsibilitiesTaken_1": "Verantwortlich für die gesamte Design- und Frontend-Umsetzung und Koordination sämtlicher relevanten Schritte, um eine benutzerfreundliche und leistungsstarke Weblösung zu gewährleisten",
                "responsibilitiesTaken_2": "Gestaltung und Umsetzung von Designs und Mock-ups, die auf die Anforderungen der Stakeholder und die Bedürfnisse der Zielgruppen abgestimmt waren",
                "responsibilitiesTaken_3": "Erfolgreiche Durchführung von SEO-Maßnahmen und Google Ads-Kampagnen zur Steigerung der Sichtbarkeit und Lead-Generierung",
                "responsibilitiesTaken_4": "Entwicklung einer performanten, kosteneffizienten und wartungsfreundlichen Weblösung, die den langfristigen Anforderungen des Unternehmens gerecht wird"
            },
            "project6": {
                "shortTitle": "Browserbasierter Ebook-Reader",
                "projectTitle": "Entwicklung eines browserbasiertem Ebook-Readers für Desktop, Tablet und Mobile",
                "role": "Frontend-Entwicklerin, UX/UI-Designerin",
                "customerType": "für einen IT-Dienstleister in der Medienbranche",
                "responsibilitiesTaken_1": "Feature-Entwicklung im Frontend unter Verwendung von Clean Code und Clean Architecture-Prinzipien mit Angular",
                "responsibilitiesTaken_2": "Durchführung von Deployment und Release-Management mit Continuous Integration und Continuous Delivery (CI/CD)",
                "responsibilitiesTaken_3": "UX/UI-Design der Webanwendung und der Landing Page",
                "responsibilitiesTaken_4": "Konzeption und Durchführung von User-Experience- und Usability-Tests"
            },
            "project7": {
                "shortTitle": "Online-Service zur Sicherung von Fotografien",
                "projectTitle": "Service zur Markierung von Bildern mit unsichtbaren Wasserzeichen",
                "role": "Frontend-Entwicklerin, Illustratorin, UX/UI-Designerin",
                "customerType": "für einen IT-Dienstleister in der Mediensicherheitsbranche",
                "responsibilitiesTaken_1": "Anforderungsanalyse und Erstellung von User Stories",
                "responsibilitiesTaken_2": "Feature-Entwicklung unter Verwendung von Clean Code und Clean Architecture-Prinzipien mit VueJS",
                "responsibilitiesTaken_3": "Aktives Mitwirken in einem agilen, crossfunktionalen Team mit zweiwöchigen Sprint-Zyklen zur Förderung von Transparenz, Flexibilität und Teameffizienz",
                "responsibilitiesTaken_4": "Konzeption und Durchführung von User-Experience- und Usability-Tests"
            }
        }
    },
    "Skills": {
        "heading": "Skills",
        "description": "",
        "skill_1": "Entwickeln von skalierbaren und zukunftssicheren Frontend-Architekturen",
        "skill_2": "Erstellen von User Journeys, Wireframes, Prototypen und MVPs",
        "skill_3": "Continuous Delivery & Continuous Integration",
        "skill_4": "Anforderungsanalysen sowie das Priorisieren, Schätzen und Schreiben von User Stories",
        "skill_5": "Zusammenarbeit in interdisziplinären Teams mit Scrum",
        "skill_6": "Durchführen von Zielgruppenanalysen und Usability-Tests",
        "skill_7": "Implementieren von Monitoring-Lösungen im Frontend",
        "skill_8": "Barrierefreie Optimierungen von Nutzeroberflächen (Accessibility)",
        "skill_9": "SEO-Optimierungen",
        "skill_10": "Gestalten und pixelgenaues Umsetzen von Mock-ups",
        "skill_11": "Know-how modernster Best-Practices im Frontend",
        "skill_12": "Implementierungen von Headless CMS",
        "skill_13": "Clean Code und Clean Architecture",
        "skill_14": "Unit-Tests, Ende-zu-Ende-Tests, Integration-Tests"
    },
    "Other": {
        "heading": "Talks & Workshops",
        "description": "Mein Wissen zu teilen und andere zu inspirieren, ist meine Leidenschaft. Wenn ich Zeit finde, halte ich gerne Workshops in Kleingruppen oder schreibe Beiträge zu Themen, die mich begeistern – von modernsten Technologien bis hin zu innovativen Ansätzen in Entwicklung und Design. Ob es darum geht, bessere Lösungen zu entwickeln oder Zusammenarbeit zu fördern, ich freue mich immer darauf, Ideen auszutauschen, Kontakte zu knüpfen und gemeinsam zu lernen.",
        "link": "Hier geht es zum",
        "workshop_1_title": "Frontend Frameworks: Beliebtheit & Einsatzzwecke",
        "workshop_1_description": "Interne Analyse von 2023 zu neuen und bewährten Frameworks und deren technischen Eigenschaften.",
        "workshop_8_title": "Frontend-Architekturen & Einführung in React",
        "workshop_8_description": "Ein einstündiger Workshop für Backend-Entwickler zur Einführung in moderne Frontend-Architekturen mit React.",
        "workshop_2_title": "Design-Workshop für Entwickler",
        "workshop_2_description": "Interner zweistündiger Mini-Workshop für Entwickler zum Thema Gestaltung und Grundlagen von UI- und UX-Design.",
        "workshop_3_title": "10 great reasons to use Gatsby in your next project",
        "workshop_3_description": "Blogpost mit 10 Vorteilen, die Gatsby als Static Site Generator bietet.",
        "workshop_4_title": "Improving any UI with 10 usability heuristics",
        "workshop_4_description": "Blogpost über 10 UI-Heuristiken, die sich bereits seit über 30 Jahren bewährt haben und heute noch aktuell sind.",
        "workshop_5_title": "Recruiting 4.0 – wie wir ein intuitives Nutzererlebnis für Bewerber geschaffen haben",
        "workshop_5_description": "Blogpost zum Thema Recruiting, in dem es um die Neugestaltung von Jobseiten geht. Unsere Ergebnisse wurden auch im Buch von Henner Knabenreich zum Thema Recruiting honoriert.",
        "workshop_6_title": "Für mehr Diversität in Entwickler-Teams",
        "workshop_6_description": "Kolumne im Java-Magazin über die Vorteile von mehr Vielfalt in Entwickler-Teams.",
        "workshop_7_title": "UX meets Design",
        "workshop_7_description": "Talk zum Thema UX-Design und Frontend-Entwicklung anhand neugestalteter Jobseiten."
    },
    "LocaleSwitcher": {
        "label": "Sprache ändern",
        "locale": "{locale, select, de {Deutsch} en {English} other {Unbekannt}}"
    },
    "Navigation": {
        "skills": "Skills",
        "projects": "Projekte",
        "other": "Talks & Workshops",
        "funFacts": "Fun Facts"
    },
    "Footer": {
        "credit": "Theodora Milona. Alle Rechte vorbehalten."
    }
}
