{
    "Intro": {
        "heading": "Hi, I'm Theo. A creative frontend developer passionate about UX, clean code, and design.",
        "description": "I've been working as a frontend developer since 2016, focusing on clean frontend architectures, precise testing, and agile collaboration in interdisciplinary, cross-functional teams. <br/><br/>My focus: modernizing processes, developing user-centered web applications, and approaching tasks with structure and a solution-oriented mindset.",
        "linkToProjects": "<link>Project overview</link>",
        "photoAlt": "A photo of me sitting on a mountain in Norway"
    },
    "Projects": {
        "heading": "Projects",
        "description": "A small selection of my favorite projects on which I contributed.",
        "filter": "Filter by technology:",
        "technologiesUsed": "Technologies used:",
        "result": "Result:",
        "responsibilities": "Responsibilities taken:",
        "projects": {
            "project1": {
                "shortTitle": "Modernization of warehouse management services",
                "projectTitle": "Modernization and enhancement of warehouse management for a renowned online retailer",
                "role": "Consultant, Frontend Developer",
                "customerType": "for a europe-wide operating online retailer",
                "responsibilitiesTaken_1": "Managed project communication in English to ensure seamless international collaboration",
                "responsibilitiesTaken_2": "Conducted pair programming and code reviews to share knowledge",
                "responsibilitiesTaken_3": "Developed browser-based features for barcode scanners to enable efficient data capture",
                "responsibilitiesTaken_4": "Collaborated with logistics and backend teams to optimize interfaces and processes",
                "result": "The project successfully digitized the picking process for approximately 25,000 daily item sales, significantly improving accuracy. A key feature was a browser-based solution for barcode scanners, enabling efficient and error-free data capture. Optimized interfaces ensured accessibility for employees with visual impairments or illiteracy, boosting productivity. External staff received training in modern frontend technologies like React, enabling them to independently continue development after handover."
            },
            "project2": {
                "shortTitle": "Recruitment platform with modern tech-stack",
                "projectTitle": "Development of a new platform for recruitment in the healthcare sector",
                "role": "Frontend Developer",
                "customerType": "for a healthcare company",
                "responsibilitiesTaken_1": "Development of a scalable frontend architecture based on modern best practices",
                "responsibilitiesTaken_2": "Rapid delivery of a functional MVP for early user testing and feedback",
                "responsibilitiesTaken_3": "Regular collaboration with stakeholders to refine project requirements",
                "responsibilitiesTaken_4": "Implementation of real-time monitoring with Sentry to improve system stability and performance"
            },
            "project3": {
                "shortTitle": "Highly performant online shop",
                "projectTitle": "Development of a new online shop for streetwear",
                "role": "Frontend Developer",
                "customerType": "for a German, locally based e-commerce company",
                "responsibilitiesTaken_1": "Utilized a static site generator with SEO optimizations to create a high-performance and fast online shop platform",
                "responsibilitiesTaken_2": "Implemented an easy-to-use content management system for flexible management and customization of shop modules",
                "responsibilitiesTaken_3": "Ensured seamless integration and communication between the Shopify system and the web frontend solution in Gatsby using GraphQL and Netlify",
                "responsibilitiesTaken_4": "Established and maintained a robust continuous integration/continuous deployment pipeline to support regular and reliable shop updates"
            },
            "project4": {
                "shortTitle": "User interface for scientists",
                "projectTitle": "Development of a user interface for distributed learning using AI",
                "role": "Frontend Developer",
                "customerType": "for a scientific institute (IT forensics and media security)",
                "responsibilitiesTaken_1": "Redesigned and implemented a web application in React with Vite, tailored for scientists to train models",
                "responsibilitiesTaken_2": "Actively participated in an agile, cross-functional team with bi-weekly sprints to enhance transparency, flexibility, and team efficiency",
                "responsibilitiesTaken_3": "Designed, developed, and tested components using TypeScript, Vitest, and Vite",
                "responsibilitiesTaken_4": "Regularly planned and conducted sprint reviews to present progress and align with stakeholders"
            },
            "project5": {
                "shortTitle": "Webapp relaunch and redesign",
                "projectTitle": "Development and redesign of an online presence",
                "role": "Frontend Developer, UX/UI Designer",
                "customerType": "for an IT service provider",
                "responsibilitiesTaken_1": "Oversaw design and frontend implementation to deliver a user-friendly, high-performance web solution",
                "responsibilitiesTaken_2": "Created designs and mock-ups tailored to stakeholder requirements and target audience needs",
                "responsibilitiesTaken_3": "Executed SEO strategies and Google Ads campaigns to improve visibility and lead generation",
                "responsibilitiesTaken_4": "Developed a performant, cost-efficient, and maintainable web solution to meet long-term business needs"
            },
            "project6": {
                "shortTitle": "Browser-based ebook reader",
                "projectTitle": "Development of a browser-based ebook reader for desktop, tablet, and mobile",
                "role": "Frontend Developer, UX/UI Designer",
                "customerType": "for an IT service provider in the media industry",
                "responsibilitiesTaken_1": "Developed frontend features using Clean Code and Clean Architecture principles with Angular",
                "responsibilitiesTaken_2": "Managed deployments and release cycles with Continuous Integration and Continuous Delivery (CI/CD)",
                "responsibilitiesTaken_3": "Designed the UX/UI for the web application and landing page",
                "responsibilitiesTaken_4": "Planned and conducted user experience and usability tests"
            },
            "project7": {
                "shortTitle": "Online service to secure photographs",
                "projectTitle": "Service for marking images with invisible watermarks",
                "role": "Frontend Developer, Illustrator, UX/UI Designer",
                "customerType": "for an IT service provider in the media security sector",
                "responsibilitiesTaken_1": "Performed requirements analysis and created user stories",
                "responsibilitiesTaken_2": "Developed features using Clean Code and Clean Architecture principles with VueJS",
                "responsibilitiesTaken_3": "Actively participated in an agile, cross-functional team with bi-weekly sprints to enhance transparency, flexibility, and team efficiency",
                "responsibilitiesTaken_4": "Planned and conducted user experience and usability tests"
            }
        }
    },
    "Skills": {
        "heading": "Skills",
        "description": "",
        "skill_1": "Developing scalable and future-proof frontend architectures",
        "skill_2": "Creating user journeys, wireframes, prototypes, and MVPs",
        "skill_3": "Continuous Delivery & Continuous Integration",
        "skill_4": "Requirement analysis as well as prioritizing, estimating, and writing user stories",
        "skill_5": "Collaboration in interdisciplinary teams using Scrum",
        "skill_6": "Conducting target audience analyses and usability testing",
        "skill_7": "Implementing monitoring solutions in the frontend",
        "skill_8": "Accessibility optimizations for user interfaces",
        "skill_9": "SEO optimizations",
        "skill_10": "Designing and pixel-perfect implementation of mock-ups",
        "skill_11": "Expertise in state-of-the-art best practices in frontend development",
        "skill_12": "Implementations of headless CMS",
        "skill_13": "Clean Code and Clean Architecture",
        "skill_14": "Unit Tests, E2E testing, Integration Tests"
    },
    "Other": {
        "heading": "Talks & Workshops",
        "description": "Sharing knowledge and inspiring others is my passion. If I find enough time, I enjoy giving workshops in small groups or write on topics that spark my curiosity, from cutting-edge technologies to innovative approaches in development and design. Whether it's about building better solutions or fostering collaboration, I'm always eager to connect, exchange ideas, and learn together.",
        "link": "Link to",
        "workshop_1_title": "Frontend Frameworks: Popularity & Use Cases",
        "workshop_1_description": "Internal 2023 analysis of new and established frameworks and their technical characteristics",
        "workshop_8_title": "Frontend Architecture Design & Introduction to React",
        "workshop_8_description": "A one-hour workshop especially for backend developers to introduce them to modern frontend architectures built with React",
        "workshop_2_title": "Design Workshop for Developers",
        "workshop_2_description": "Internal two-hour mini-workshop for developers on design principles and the basics of UI and UX design",
        "workshop_3_title": "10 Great Reasons to Use Gatsby in Your Next Project",
        "workshop_3_description": "Blog post highlighting 10 advantages of using Gatsby as a static site generator",
        "workshop_4_title": "Improving Any UI with 10 Usability Heuristics",
        "workshop_4_description": "Blog post discussing 10 time-tested UI heuristics that have been relevant for over 30 years and are still applicable today",
        "workshop_5_title": "Recruiting 4.0 – How We Created an Intuitive User Experience for Applicants",
        "workshop_5_description": "Blog post about recruiting and redesigning job pages. Our results were also recognized in Henner Knabenreich's book on recruiting.",
        "workshop_6_title": "For More Diversity in Development Teams",
        "workshop_6_description": "Column in Java Magazine about the benefits of increased diversity in development teams",
        "workshop_7_title": "UX Meets Design",
        "workshop_7_description": "Talk on UX design and frontend development using redesigned job pages as an example"
    },
    "FunFacts": {
        "heading": "Fun Facts",
        "funFact_1": "I love animals, especially dwarf hamsters.",
        "funFact_2": "For three months, I went to a japanese middle school in 2009.",
        "funFact_3": "I enjoy practicing yoga since 2013 in my free time.",
        "funFact_4": "I love watching horror movies.",
        "funFact_5": "I like to paint landscapes with watercolors.",
        "funFact_6": "I was 13 years old when I built my first website."
    },
    "LocaleSwitcher": {
        "label": "Change language",
        "locale": "{locale, select, de {Deutsch} en {English} other {Unknown}}"
    },
    "Navigation": {
        "skills": "Skills",
        "projects": "Projects",
        "other": "Talks & Workshops",
        "funFacts": "Fun facts"
    },
    "Footer": {
        "credit": "Theodora Milona. All rights reserved."
    }
}
